### SQL Module From Yandex Praktikum Data Analyst Course

Tasks were solved using **PostgreSQL**

###### SELECT

In [ ]:
# Select columns: id_product, name, category, name_store 
# From: products_data_all
SELECT 
  id_product, 
  name, 
  category, 
  name_store 
FROM 
  products_data_all;

In [ ]:
# Retrieve all columns from products_data_all
SELECT 
  * 
FROM 
  products_data_all;

In [ ]:
# Retrieve all columns from transactions
SELECT 
  * 
FROM 
  transactions;

In [ ]:
# Retrieve all columns from weather
SELECT 
  * 
FROM 
  weather;

###### WHERE

In [ ]:
# Select data having category 'milk & cream' and update date 2019-06-01
SELECT 
  name, 
  price, 
  name_store, 
  date_upd 
FROM 
  products_data_all 
WHERE 
  category = 'milk & cream' 
  AND date_upd = '2019-06-01';

In [ ]:
# Select data having category 'milk & cream' and update date 2019-06-08, 
# 2019-06-15, 2019-06-22, 2019-06-29
SELECT 
  name, 
  price, 
  name_store, 
  date_upd 
FROM 
  products_data_all 
WHERE 
  category = 'milk & cream' 
  AND date_upd IN (
    '2019-06-08', '2019-06-15', '2019-06-22', 
    '2019-06-29'
  );

In [ ]:
# Select data having id_product from a provided list and 
# date 2019-06-01 and 2019-06-02
SELECT 
  * 
FROM 
  transactions 
WHERE 
  date BETWEEN '2019-06-01' 
  AND '2019-06-02' 
  AND id_product IN (
    0, 1, 2, 3, 4, 6, 7, 8, 9, 10, 11, 12, 13, 15, 
    16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 
    26, 28, 29, 30, 31, 32, 34, 35, 36, 37, 
    38, 39, 40, 42, 43, 44, 45, 47, 48, 49, 
    50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 
    60, 61, 63, 64, 65, 66, 67, 68, 69, 70, 
    71, 72, 73, 74, 75, 76, 77, 78, 80, 81, 
    82, 83, 84, 86, 88, 89, 90, 91, 92, 93, 
    95, 96, 97, 98, 99, 100, 102, 103, 104, 
    105, 106, 107, 108, 109, 110, 111, 112, 
    113, 114, 115, 116, 118, 119, 5, 14, 27, 
    33, 41, 46, 62, 79, 85, 87, 94, 101, 117
  );

###### Aggregate Functions

In [ ]:
# Count an overall number of rows of the products_data_all table
SELECT 
  COUNT(*) AS cnt 
FROM 
  products_data_all;

In [ ]:
# Count an overall number of rows, number of values and unque values of
# the name column in the products_data_all table
SELECT 
  COUNT(*) AS cnt, 
  COUNT(name) AS name_cnt, 
  COUNT(DISTINCT name) AS name_uniq_cnt 
FROM 
  products_data_all;

In [ ]:
# Calculate an average price (products_data_all table) 
SELECT 
  AVG(price) AS average 
FROM 
  products_data_all;

In [ ]:
# Calculate an average price of a product 'Мilk 2,5%, 930 ml' 
# in the 'Seventh store'
SELECT 
  AVG(price) AS average 
FROM 
  products_data_all 
WHERE 
  name = 'Мilk 2,5%, 930 ml' 
  AND name_store = 'Seventh store';

In [ ]:
# Calculate the total worth of all products in the 'Milky' store
SELECT 
  SUM(price) AS summa 
FROM 
  products_data_all 
WHERE 
  name_store = 'Milky';

In [ ]:
# Find the max price in the products_data_all table
SELECT 
  MAX(price) AS max_price 
FROM 
  products_data_all;

In [ ]:
# Find the difference between the max and min price of a product
# 'Dairy Butter Ecotavush 99%, 500 g' in the 'TasteMall' store
SELECT 
  MAX(price) - MIN(price) AS max_min_diff 
FROM 
  products_data_all 
WHERE 
  name = 'Dairy Butter Ecotavush 99%, 500 g' 
  AND name_store = 'TasteMall'

###### Data Types CASTing

In [ ]:
# Calculate an average weight for products weighted in grams
SELECT 
  AVG(
    CAST(weight AS real)
  ) AS average 
FROM 
  products_data_all 
WHERE 
  units = 'г';

In [ ]:
# Find the max weight of a product in the category 'milk & cream'
SELECT 
  MAX(
    CAST(weight AS real)
  ) AS max_weight 
FROM 
  products_data_all 
WHERE 
  category = 'milk & cream';

###### GROUP BY

In [ ]:
# Count number of products and unique products in various stores 
# (group the result by store names)
SELECT 
  name_store, 
  COUNT(name) AS name_cnt, 
  COUNT(DISTINCT name) AS name_uniq_cnt 
FROM 
  products_data_all 
GROUP BY 
  name_store;

In [ ]:
# Count the max weight of a product for each products' category
SELECT 
  category, 
  MAX(
    CAST(weight AS real)
  ) 
FROM 
  products_data_all 
GROUP BY 
  category;

In [ ]:
# Calculate max, min and average price for products in each store
SELECT 
  name_store, 
  AVG(price) AS average_price, 
  MAX(price) AS max_price, 
  MIN(price) AS min_price 
FROM 
  products_data_all 
GROUP BY 
  name_store;

In [ ]:
# # Find the difference between the max and min price for each product
# in the category 'dairy butter' on the 2019-06-10
SELECT 
  name, 
  MAX(price) - MIN(price) AS max_min_diff 
FROM 
  products_data_all 
WHERE 
  category = 'dairy butter' 
  AND CAST(date_upd AS date) = '2019-06-10' 
GROUP BY 
  name;

###### ORDER BY

In [ ]:
# Find the number of products in each category for the 2019-06-05.
# Sort the result in ascending order.
SELECT 
  CAST(date_upd AS date) AS update_date, 
  category, 
  COUNT(name) AS name_cnt 
FROM 
  products_data_all 
WHERE 
  CAST(date_upd AS date) = '2019-06-05' 
GROUP BY 
  category, 
  update_date 
ORDER BY 
  name_cnt ASC;

In [ ]:
# Count the number of unique products in each category 
# in the 'Lentro' store on the '2019-06-30'.
# Sort the result in descending order
SELECT 
  CAST(date_upd AS date) AS update_date, 
  name_store, 
  category, 
  COUNT(DISTINCT name) AS uniq_name_cnt 
FROM 
  products_data_all 
WHERE 
  name_store = 'Lentro' 
  AND CAST(date_upd AS date) = '2019-06-30' 
GROUP BY 
  update_date, 
  name_store, 
  category 
ORDER BY 
  uniq_name_cnt DESC;

###### LIMIT

In [ ]:
# Find the top-5 most expensive products.
SELECT 
  name, 
  MAX(price) AS max_price 
FROM 
  products_data_all 
GROUP BY 
  name 
ORDER BY 
  max_price DESC 
LIMIT 
  5;

###### HAVING

In [ ]:
# Find the max price of each product. Show the name and the max price
# of the products having the max price > 500.
SELECT 
  name, 
  MAX(price) AS max_price 
FROM 
  products_data_all 
GROUP BY 
  name 
HAVING 
  MAX(price) > 500;

In [ ]:
# Find the amount of products having weight > 900 g for the '2019-06-03'
# Group the result by store name and show only products having the 
# amount < 10.
SELECT 
  CAST(date_upd AS date) AS update_date, 
  name_store, 
  COUNT(name) AS name_cnt 
FROM 
  products_data_all 
WHERE 
  (
    CAST(date_upd AS date) = '2019-06-03' 
    AND units = 'г'
  ) 
  AND CAST(weight AS real) > 900 
GROUP BY 
  name_store, 
  CAST(date_upd AS date) 
HAVING 
  COUNT(name) < 10;

In [ ]:
# Find the amount of unique products for each store. Reveal three
# stores with the least amount of unique goods among stores having more
# than 30 uniqe products.
SELECT 
  name_store, 
  COUNT(DISTINCT name) AS name_uniq_cnt 
FROM 
  products_data_all 
GROUP BY 
  name_store 
HAVING 
  COUNT(DISTINCT name) > 30 
ORDER BY 
  COUNT(DISTINCT name) ASC 
LIMIT 
  3;

###### EXTRACT

In [ ]:
# Extract hours from the date column (transactions table)
SELECT 
  EXTRACT(
    HOUR 
    FROM 
      date
  ) AS hours 
FROM 
  transactions;

In [ ]:
# Extract hours from the date column (transactions table)
# Group the data by hours and count the amount of products being sold.
# Sort the data by hours in ascending order.
SELECT 
  EXTRACT(
    HOUR 
    FROM 
      date
  ) AS hours, 
  COUNT(id_product) AS cnt 
FROM 
  transactions 
GROUP BY 
  hours 
ORDER BY 
  hours;

In [ ]:
# Extract day values from the date column (transactions table)
# Group the data by days and count the amount of products being sold.
# Sort the data by days in ascending order. 
SELECT 
  EXTRACT(
    DAY 
    FROM 
      date
  ) AS days, 
  COUNT(id_product) AS cnt 
FROM 
  transactions 
GROUP BY 
  days 
ORDER BY 
  days ASC;

###### DATE_TRUNC

In [ ]:
# Truncate the date to day. Group the data by days and 
# count the amount of products being sold.
# Sort the data by days in ascending order.  
SELECT 
  DATE_TRUNC('day', date) AS date_month, 
  COUNT(id_product) AS cnt 
FROM 
  transactions 
GROUP BY 
  date_month 
ORDER BY 
  date_month ASC;

###### Subqueries

In [ ]:
# Query product ids from the table products_data_all
# having category 'milk & cream' and the price > 120
# or the category 'dairy butter' and the price > 354
SELECT 
  id_product 
FROM 
  products_data_all 
WHERE 
  (
    category = 'milk & cream' 
    AND price > 120
  ) 
  OR (
    category = 'dairy butter' 
    AND price > 354
  );

In [ ]:
# Find unique user ids who has bought products from the category 'milk & cream' 
# and having the price > 120 or from the category 'dairy butter' 
# and having the price > 354
SELECT 
  DISTINCT(user_id) 
FROM 
  transactions 
WHERE 
  id_product IN (
    SELECT 
      id_product 
    FROM 
      products_data_all 
    WHERE 
      (
        category = 'milk & cream' 
        AND price > 120
      ) 
      OR (
        category = 'dairy butter' 
        AND price > 354
      )
  );

In [ ]:
# Truncate the date to day and count unique transactions
SELECT 
  COUNT(DISTINCT id_transaction) AS transaction_per_day, 
  DATE_TRUNC('day', date) AS trunc_date 
FROM 
  transactions 
GROUP BY 
  trunc_date;

In [ ]:
# Use the previous query as a subquery to extract week numbers
# and calculate an average number of transactions per day.
# Group the result by week numbers.
SELECT 
  EXTRACT(
    WEEK 
    FROM 
      SUBQ.trunc_date
  ) AS week_number, 
  AVG(SUBQ.transaction_per_day) AS avg_week_transaction 
FROM 
  (
    SELECT 
      COUNT(DISTINCT id_transaction) AS transaction_per_day, 
      DATE_TRUNC('day', date) AS trunc_date 
    FROM 
      transactions 
    GROUP BY 
      trunc_date
  ) AS SUBQ 
GROUP BY 
  week_number;

In [ ]:
tbc..